import React from 'react';

interface MenuItem {
    id: string;
    label: React.ReactNode[];
}

export const menuItems: MenuItem[] = [
    {
        id: 'Комплексные и прединвестиционные исследования рынка',
        label: [
            React.createElement('p', { key: '1' }, 
                'Здоровье бренда – группа исследовательских задач, решение которых ориентировано на выявление сильных и слабых сторон торговой марки и ее позиции на рынке относительно марок конкурентов, рассмотренных в категориях их восприятия конечными потребителями.'
            ),
            React.createElement('p', { key: '2' }, 
                'Для того, чтобы эффективно планировать маркетинговые активности в части продвижения торговой марки, крайне важным является точно понимать, какое место в сознании потребителя на данный момент занимает бренд. Для этого применяют группу исследовательских задач «Здоровье бренда». Они используются для того, чтобы: определить расположение марки в рыночном сегменте относительно конкурентов, выявить сильные и слабые стороны, оценить восприятие потребителями и т.д.'
            ),
            React.createElement('p', { key: '3' }, 
                'Какую информацию позволяет получить Здоровье бренда:'
            ),
            React.createElement('ul', { key: '4' }, 
                React.createElement('li', null, 
                    'Узнаваемость торговой марки – Top of mind (первая спонтанно названная марка), спонтанное знание (UBA), знание с подсказкой (выбор из предложенного списка) (ABA);'
                )
            ),
            React.createElement('p', { key: '1' }, 
                'Здоровье бренда – группа исследовательских задач, решение которых ориентировано на выявление сильных и слабых сторон торговой марки и ее позиции на рынке относительно марок конкурентов, рассмотренных в категориях их восприятия конечными потребителями.'
            ),
            React.createElement('p', { key: '2' }, 
                'Для того, чтобы эффективно планировать маркетинговые активности в части продвижения торговой марки, крайне важным является точно понимать, какое место в сознании потребителя на данный момент занимает бренд. Для этого применяют группу исследовательских задач «Здоровье бренда». Они используются для того, чтобы: определить расположение марки в рыночном сегменте относительно конкурентов, выявить сильные и слабые стороны, оценить восприятие потребителями и т.д.'
            ),
            React.createElement('p', { key: '3' }, 
                'Какую информацию позволяет получить Здоровье бренда:'
            ),
            React.createElement('ul', { key: '4' }, 
                React.createElement('li', null, 
                    'Узнаваемость торговой марки – Top of mind (первая спонтанно названная марка), спонтанное знание (UBA), знание с подсказкой (выбор из предложенного списка) (ABA);'
                )
            )
        ]
    },
    {
        id: 'Исследования целевой аудитории',
        label: [
            React.createElement('p', { key: '1' }, 
                'Здоровье бренда – группа исследовательских задач, решение которых ориентировано на выявление сильных и слабых сторон торговой марки и ее позиции на рынке относительно марок конкурентов, рассмотренных в категориях их восприятия конечными потребителями.'
            ),
            React.createElement('p', { key: '2' }, 
                'Для того, чтобы эффективно планировать маркетинговые активности в части продвижения торговой марки, крайне важным является точно понимать, какое место в сознании потребителя на данный момент занимает бренд. Для этого применяют группу исследовательских задач «Здоровье бренда». Они используются для того, чтобы: определить расположение марки в рыночном сегменте относительно конкурентов, выявить сильные и слабые стороны, оценить восприятие потребителями и т.д.'
            ),
            React.createElement('p', { key: '3' }, 
                'Какую информацию позволяет получить Здоровье бренда:'
            ),
            React.createElement('ul', { key: '4' }, 
                React.createElement('li', null, 
                    'Узнаваемость торговой марки – Top of mind (первая спонтанно названная марка), спонтанное знание (UBA), знание с подсказкой (выбор из предложенного списка) (ABA);'
                )
            )
        ]
    },
    {
        id: 'Оценка узнаваемости, здоровья бренда',
        label: [
            React.createElement('p', { key: '1' }, 
                'Здоровье бренда – группа исследовательских задач, решение которых ориентировано на выявление сильных и слабых сторон торговой марки и ее позиции на рынке относительно марок конкурентов, рассмотренных в категориях их восприятия конечными потребителями.'
            ),
            React.createElement('p', { key: '2' }, 
                'Для того, чтобы эффективно планировать маркетинговые активности в части продвижения торговой марки, крайне важным является точно понимать, какое место в сознании потребителя на данный момент занимает бренд. Для этого применяют группу исследовательских задач «Здоровье бренда». Они используются для того, чтобы: определить расположение марки в рыночном сегменте относительно конкурентов, выявить сильные и слабые стороны, оценить восприятие потребителями и т.д.'
            ),
            React.createElement('p', { key: '3' }, 
                'Какую информацию позволяет получить Здоровье бренда:'
            ),
            React.createElement('ul', { key: '4' }, 
                React.createElement('li', null, 
                    'Узнаваемость торговой марки – Top of mind (первая спонтанно названная марка), спонтанное знание (UBA), знание с подсказкой (выбор из предложенного списка) (ABA);'
                )
            )
        ]
    },
    {
        id: 'Оценка удовлетворенности потребителей',
        label: [
            React.createElement('p', { key: '1' }, 
                'Здоровье бренда – группа исследовательских задач, решение которых ориентировано на выявление сильных и слабых сторон торговой марки и ее позиции на рынке относительно марок конкурентов, рассмотренных в категориях их восприятия конечными потребителями.'
            ),
            React.createElement('p', { key: '2' }, 
                'Для того, чтобы эффективно планировать маркетинговые активности в части продвижения торговой марки, крайне важным является точно понимать, какое место в сознании потребителя на данный момент занимает бренд. Для этого применяют группу исследовательских задач «Здоровье бренда». Они используются для того, чтобы: определить расположение марки в рыночном сегменте относительно конкурентов, выявить сильные и слабые стороны, оценить восприятие потребителями и т.д.'
            ),
            React.createElement('p', { key: '3' }, 
                'Какую информацию позволяет получить Здоровье бренда:'
            ),
            React.createElement('ul', { key: '4' }, 
                React.createElement('li', null, 
                    'Узнаваемость торговой марки – Top of mind (первая спонтанно названная марка), спонтанное знание (UBA), знание с подсказкой (выбор из предложенного списка) (ABA);'
                )
            )
        ]
    },
    {
        id: 'Изучение восприятия продукта, услуги',
        label: [
            React.createElement('p', { key: '1' }, 
                'Здоровье бренда – группа исследовательских задач, решение которых ориентировано на выявление сильных и слабых сторон торговой марки и ее позиции на рынке относительно марок конкурентов, рассмотренных в категориях их восприятия конечными потребителями.'
            ),
            React.createElement('p', { key: '2' }, 
                'Для того, чтобы эффективно планировать маркетинговые активности в части продвижения торговой марки, крайне важным является точно понимать, какое место в сознании потребителя на данный момент занимает бренд. Для этого применяют группу исследовательских задач «Здоровье бренда». Они используются для того, чтобы: определить расположение марки в рыночном сегменте относительно конкурентов, выявить сильные и слабые стороны, оценить восприятие потребителями и т.д.'
            ),
            React.createElement('p', { key: '3' }, 
                'Какую информацию позволяет получить Здоровье бренда:'
            ),
            React.createElement('ul', { key: '4' }, 
                React.createElement('li', null, 
                    'Узнаваемость торговой марки – Top of mind (первая спонтанно названная марка), спонтанное знание (UBA), знание с подсказкой (выбор из предложенного списка) (ABA);'
                )
            )
        ]
    },
];

export default menuItems;